---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForHeight
source: html/dd059264-89b9-5042-15de-99507bef24d3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForHeight Property

Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]).

## Syntax (C#)
```csharp
public static FailureDefinitionId LiningThicknessIsLargeForHeight { get; }
```